In [1]:
# pip install mysql-connector-python

In [1]:
import mysql.connector

In [2]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Mysql@2022"
)

In [3]:
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000017831C72940>

In [4]:
mycursor = mydb.cursor(buffered=True)

# mycursor.execute("CREATE DATABASE testDatabase")

In [11]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('testdatabase',)
('university',)
('world',)

In [12]:
mycursor.execute("CREATE database userdet")

In [17]:
mycursor.execute("USE userdet")

In [18]:

mycursor.execute("CREATE TABLE info_table (firstname varchar(255),lastname varchar(255),password varchar(255),favcar varchar(20))")

In [20]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('info_table',)

In [10]:
mycursor.execute("drop database userdet")

### FOR EXERCISE

In [7]:
mycursor.execute("use testdatabase")

In [8]:
# mycursor.execute("CREATE TABLE customers(name VARCHAR(255), address VARCHAR(255))")

In [9]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('customers',)

In [10]:

# mycursor.execute("CREATE TABLE customers (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")

In [11]:
# mycursor.execute("ALTER TABLE customers ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

In [12]:
# INSERT
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John", "Highway 21")
mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")

1 record inserted.

In [13]:
# INSERT MULTIPLE ROWS


sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

13 was inserted.

In [14]:
# You can get the id of the row you just inserted by asking the cursor object.

# Note: If you insert more than one row, the id of the last inserted row is returned.

In [15]:
mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)
# We use the fetchall() method, which fetches all rows from the last executed statement.

('John', 'Highway 21')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')
('John', 'Highway 21')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')

In [16]:
mycursor.execute("SELECT name FROM customers")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('John',)
('Peter',)
('Amy',)
('Hannah',)
('Michael',)
('Sandy',)
('Betty',)
('Richard',)
('Susan',)
('Vicky',)
('Ben',)
('William',)
('Chuck',)
('Viola',)
('John',)
('Peter',)
('Amy',)
('Hannah',)
('Michael',)
('Sandy',)
('Betty',)
('Richard',)
('Susan',)
('Vicky',)
('Ben',)
('William',)
('Chuck',)
('Viola',)

In [17]:
# If you are only interested in one row, you can use the fetchone() method.

# The fetchone() method will return the first row of the result:

mycursor.execute("SELECT name FROM customers")
myresult = mycursor.fetchone()

print(myresult)

('John',)

In [18]:
sql ="SELECT * FROM customers WHERE address LIKE '%way%'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('John', 'Highway 21')
('Susan', 'One way 98')
('Viola', 'Sideway 1633')
('John', 'Highway 21')
('Susan', 'One way 98')
('Viola', 'Sideway 1633')

In [19]:

sql = "SELECT * FROM customers ORDER BY name"

sql = "SELECT * FROM customers ORDER BY name DESC"

In [22]:

sql = "DELETE FROM customers WHERE address = 'Mountain 21'"

mycursor.execute(sql)

mydb.commit()

In [23]:
# mydb.commit(). It is required to make the changes, otherwise no changes are made to the table.

# Notice the WHERE clause in the DELETE syntax:
#     The WHERE clause specifies which record(s) that should be deleted. 
#     If you omit the WHERE clause, all records will be deleted!

In [ ]:

sql = "DELETE FROM customers WHERE address = %s"
adr = ("Yellow Garden 2", )

mycursor.execute(sql, adr)

mydb.commit()

In [ ]:

sql = "DROP TABLE customers"

mycursor.execute(sql)

In [ ]:
If the table you want to delete is already deleted, or for any other reason does not exist, you can use the IF EXISTS keyword to avoid getting an error.
sql = "DROP TABLE IF EXISTS customers"

mycursor.execute(sql)

In [24]:

sql = "UPDATE customers SET address = 'Canyon 123' WHERE address = 'Valley 345'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) affected")

2 record(s) affected

In [25]:

sql = "UPDATE customers SET address = %s WHERE address = %s"
val = ("Valley 345", "Canyon 123")

mycursor.execute(sql, val)

mydb.commit()

In [27]:

mycursor.execute("SELECT * FROM customers LIMIT 5")

myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('John', 'Highway 21')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')